
                ifndef _MODULE_GAME_OBJECT_UPDATE_DECAL_
                define _MODULE_GAME_OBJECT_UPDATE_DECAL_
; -----------------------------------------
; обновление декали
; In:
;   IX - адрес обрабатываемого объекта FObject
; Out:
; Corrupt:
; Note:
; ----------------------------------------
Decal:          ; -----------------------------------------
                ; расчёт дельт позиции декали
                ; -----------------------------------------

                LD BC, (PlayerState.CameraPosX + 1)
                LD HL, (IX + FObjectDecal.Location.X.Low)
                OR A
                SBC HL, BC
                EX DE, HL

                LD BC, (PlayerState.CameraPosX + 3)
                LD HL, (IX + FObjectDecal.Location.X.High)  
                SBC HL, BC
                ; JP NZ, .Remove                                                  ; переход, если объект дальше от -32768 до +32767
                EX DE, HL

                ; -----------------------------------------
                ;   значение фиксированной точки 12.4 (знаковое)    [от -2^11 до +2^11 в пикселях]
                ;   2 байта на каждую ось X,Y
                ;
                ;   +----+----+----+----+----+----+----+----+   +----+----+----+----+----+----+----+----+
                ;   | 15 | 14 | 13 | 12 | 11 | 10 |  9 |  8 |   |  7 |  6 |  5 |  4 |  3 |  2 |  1 |  0 |
                ;   +----+----+----+----+----+----+----+----+   +----+----+----+----+----+----+----+----+
                ;   | I11| I10| I9 | I8 | I7 | I6 | I5 | I4 |   | I3 | I2 | I1 | I0 | F0 | F1 | F2 | F3 |
                ;   +----+----+----+----+----+----+----+----+   +----+----+----+----+----+----+----+----+
                ;
                ;   I11-I0  [15..4] - целая часть фиксированной точки 12.4
                ;   F0-F3   [3..0]  - дробная часть фиксированной точки 12.4
                ; -----------------------------------------
                LD H, L
                LD A, (World.Shift_X)
                ADD A, A
                ADD A, A
                ADD A, A
                ADD A, A
                LD L, A
                LD A, #E0
                SUB L
                LD L, A
                LD (IX + FObjectDecal.Position.X), HL                           ; сохранение позиции юнита по горизонтали

                LD BC, (PlayerState.CameraPosY + 3)
                LD HL, (IX + FObjectDecal.Location.Y.High)
                OR A
                SBC HL, BC
                ; JR NZ, .Remove                                                  ; переход, если объект дальше от -32768 до +32767

                ; 
                LD BC, (PlayerState.CameraPosY + 1)
                LD HL, (IX + FObjectDecal.Location.Y.Low)
                SBC HL, BC

                ; -----------------------------------------
                ;   значение фиксированной точки 12.4 (знаковое)    [от -2^11 до +2^11 в пикселях]
                ;   2 байта на каждую ось X,Y
                ;
                ;   +----+----+----+----+----+----+----+----+   +----+----+----+----+----+----+----+----+
                ;   | 15 | 14 | 13 | 12 | 11 | 10 |  9 |  8 |   |  7 |  6 |  5 |  4 |  3 |  2 |  1 |  0 |
                ;   +----+----+----+----+----+----+----+----+   +----+----+----+----+----+----+----+----+
                ;   | I11| I10| I9 | I8 | I7 | I6 | I5 | I4 |   | I3 | I2 | I1 | I0 | F0 | F1 | F2 | F3 |
                ;   +----+----+----+----+----+----+----+----+   +----+----+----+----+----+----+----+----+
                ;
                ;   I11-I0  [15..4] - целая часть фиксированной точки 12.4
                ;   F0-F3   [3..0]  - дробная часть фиксированной точки 12.4
                ; -----------------------------------------
                LD H, L
                LD A, (World.Shift_Y)
                ADD A, A
                ADD A, A
                ADD A, A
                ADD A, A
                LD L, A
                LD (IX + FObjectDecal.Position.Y), HL                           ; сохранение позиции юнита по вертикали

                JP Game.Object.Update.RET

.Remove         ; ToDo удалить объект
                LD (IX + FObjectDecal.Type), OBJECT_EMPTY_ELEMENT
                LD HL, GameState.Objects
                DEC (HL)
                JP Game.Object.Update.RET

                endif ; ~_MODULE_GAME_OBJECT_UPDATE_DECAL_
